Revit 2027 API
BuiltInFailures.RebarShapeFailures.CircleUnbounded Property
 An unbounded circle can only be used to construct a spiral shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircleUnbounded { get; }
Public Shared ReadOnly Property CircleUnbounded As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircleUnbounded {
	FailureDefinitionId^ get ();
}
static member CircleUnbounded : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace